# Stairs Path Type Arrowhead Type Id Property

Source: https://www.revitapidocs.com/2026/3c6c3cb9-9fa0-ecbf-c6a3-1ef77d783708.htm

---

| Stairs Path Type Arrowhead Type Id Property |
| --- |

The arrow head type of the stairs path.
**Namespace:** Autodesk.Revit.DB.Architecture
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId ArrowheadTypeId { get; set; }
```

```
Public Property ArrowheadTypeId As ElementId
	Get
	Set
```

```
public:
property ElementId^ ArrowheadTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member ArrowheadTypeId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The arrowheadTypeId is not a valid start symbol or arrowhead type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

StairsPathType Class Autodesk.Revit.DB.Architecture Namespace